// Написать программу, которая из имеющегося массива строк формирует массив из строк, длинна которых меньше либо равна 3 символа. 
// Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алкогитма.
// При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами
Console.WriteLine("Введите количество необходимых индексов для массива");
int c = Convert.ToInt32(Console.ReadLine());